app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('Example User', 'user@example.com', '2012-02-13 15:38:55.884800', '2012-02-13 15:38:55.884800', '56c82929d90ff359f1c4405368d5d760a218e121b48b3c1ae362975b2b3e6607', '9c3a2d4c7e8b30992b159e897a84b32995364d90946bfd37aed0460f246e30d2', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "salt" = '18bd582847b52bd9454d771ab7742bcec4299565d7da2ed7b580828f5e421245', "encrypted_password" = 'abef35692eec219f218f39bb1878ee3983d1c8da67202a11824a1d0a8550a97d', "updated_at" = '2012-02-13 13:14:11.763800' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "users"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy